dataset_gen/Flowbench_Openfoam/FPO_External/Irregular/Design_Point_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          128;
        startFace       31968;
    }
    right
    {
        type            patch;
        nFaces          128;
        startFace       32096;
    }
    bottom
    {
        type            patch;
        nFaces          128;
        startFace       32224;
    }
    top
    {
        type            patch;
        nFaces          128;
        startFace       32352;
    }
    hole
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          64;
        startFace       32480;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32256;
        startFace       32544;
    }
)

// ************************************************************************* //
